import random

def guess_the_number():
    print("გამარჯობა! მოდი ვითამაშოთ რიცხვების გამოცნობის თამაში.")
    # კომპიუტერი ირჩევს შემთხვევით რიცხვს 1-დან 100-მდე
    number = random.randint(1, 100)
    
    # მაქსიმუმ 7 ცდა
    attempts = 7
    
    # თამაში გრძელდება სანამ მომხმარებელი ან გამოცნობს რიცხვს ან ამოწურავს მცდელობებს
    while attempts > 0:
        try:
            # მომხმარებელს ვთხოვთ შეიყვანოს რიცხვი
            guess = int(input(f"შენ დაგრჩა {attempts} ცდა: გამოიცანი რიცხვი 1-დან 100-მდე: "))
            
            # ვამოწმებთ გამოიცნო თუ არა
            if guess == number:
                print(f"გილოცავ! შენ გამოიცანი რიცხვი {number}!")
                break
            elif guess < number:
                print("შენი რიცხვი პატარაა!")
            else:
                print("შენი რიცხვი დიდია!")
                
            # მცდელობა ერთით მცირდება
            attempts -= 1
            
        except ValueError:
            print("გთხოვთ შეიყვანოთ ციფრი.")
    
    if attempts == 0:
        print(f"სამწუხაროდ არ გაგიმართლა! რიცხვი იყო {number}.")

# თამაში იწყება ამ ფუნქციის გამოძახებით
guess_the_number()
